

	program main
	USE LDCSEM_DATA
    USE FREQUENCY_FORWARD
    USE D1_CSAMTINV
!===================================================================
    IMPLICIT NONE
!===================================================================
    INTEGER :: I,J,K,L,S,M,N,WN,LLD,ZFYN,JXDL,TEDM
    INTEGER :: MOD_RLZ,DIEDAI,ND,NT,POTNS
    INTEGER :: DATE_XZ(6),MAX_FDN,LLL
	REAL(8) :: TOP_D,MAX_H,MAX_R,DSQ,BTAS
	REAL(8) :: BHS,DXBG,SUH,SmH
	REAL(8),ALLOCATABLE :: F(:),T(:),FG(:),AVS(:)
	TYPE(TYPE_CDINF) :: CDBLF
	TYPE(TYPE_ISINF),ALLOCATABLE :: LSI(:)
	TYPE(TYPE_CDINF),ALLOCATABLE :: CDBL(:)
	TYPE(TYPE_MODINF),ALLOCATABLE :: MODS(:),MODF(:)
	TYPE(TYPE_EHINF),ALLOCATABLE :: EH_F(:),EH_FY(:)
	TYPE(TYPE_EHINF),ALLOCATABLE :: EV_T(:),EV_ERSY(:)
	CHARACTER(100) :: Mod_FILE,OUT_FILE,FY_MOD_N
!===================================================================
	WRITE(*,*)
	WRITE(*,*)
	WRITE(*,*)"    ========================================================="
	WRITE(*,*)"             1、NCSEM电磁场(Ex-Ey-Ez-Hx-Hy-Hz)               "
	WRITE(*,*)"             2、NSOTEM电磁场(Ext-Eyt-Ezt-Vxt-Vyt-Vzt)        "
	WRITE(*,*)"                  正演/反演程序 2.0.0版                      "
	WRITE(*,*)"    ========================================================="
16	WRITE(*,*)
	WRITE(*,*)"    请确定研究方法:1---NCSEM电磁场(Ex-Ey-Ez-Hx-Hy-Hz)"
	WRITE(*,*)"                   2---NSOTEM电磁场(Ext-Eyt-Ezt-Vxt-Vyt-Vzt)"
	WRITE(*,"(A,$)")"              方法:"
	READ(*,*)TEDM
	WRITE(*,*)"    请选择研究模式:1---正演"
	WRITE(*,*)"                   2---反演"
	WRITE(*,"(A,$)")"              模式:"
	READ(*,*)ZFYN
!*******************************************************************
!==================================================================
	IF (ZFYN==1) THEN
!*******************************************************************
	WRITE(*,"(a,$)")"    请输入模型文件名:"
	READ(*,*)Mod_FILE
	WRITE(*,"(a,$)")"    请输入结果文件名:"
	READ(*,*)OUT_FILE
    !----------------------------------------------------------
	OPEN(12,FILE=Mod_FILE)
	READ(12,*)
	READ(12,*)POTNS  !源的个数
	READ(12,*)
    ALLOCATE( LSI(POTNS) )
	DO I=1,POTNS
       READ(12,*)LSI(I)%AX,LSI(I)%AY,LSI(I)%AZ, &
	             LSI(I)%BX,LSI(I)%BY,LSI(I)%BZ,LSI(I)%IS
	END DO
	READ(12,*)
	READ(12,*)ND       !测点个数
	READ(12,*)
    ALLOCATE( CDBL(ND) )
	READ(12,*)(CDBL(I)%N,CDBL(I)%X,CDBL(I)%Y,CDBL(I)%Z,I=1,ND)  !测点坐标
	READ(12,*)
	READ(12,*)N,M      !层数、频率数
    ALLOCATE( MODS(N) )
	IF (TEDM==1 ) ALLOCATE( F(M) )  !频率
	IF (TEDM==2 ) ALLOCATE( T(M) )  !时间
	READ(12,*)
	READ(12,*)(MODS(I)%H,MODS(I)%R,I=1,N)
	READ(12,*)
	IF (TEDM==1 ) READ(12,*)(F(I),I=1,M)  !频率
	IF (TEDM==2 ) READ(12,*)(T(I),I=1,M)  !时间
	CLOSE(12)
!===================================================================
!*******************************************************************
!===================================================================
    IF (TEDM/=1) GOTO 130
	ALLOCATE( EH_F(M) )
!===================================================================
	OPEN(unit=50,file="LD_NCSEM_"//OUT_FILE)
	OPEN(unit=51,file="LC_NCSEM_"//OUT_FILE)
!===================================================================
	WRITE(50,"(A)")"源的个数"
	WRITE(50,"(I5)")POTNS
	WRITE(50,"(A)")"源位置:AX(米)      AY(米)      AZ(米)     BX(米)      BY(米)       BZ(米) 源电流(安培)"
    DO I=1,POTNS
	WRITE(50,"(6F12.2,F8.2)")LSI(I)%AX,LSI(I)%AY,LSI(I)%AZ,LSI(I)%BX,LSI(I)%BY,LSI(I)%BZ,LSI(I)%IS
    END DO
	WRITE(50,"(A)")"测点数,数据频点数"
	WRITE(50,"(2I5)")ND,M
	WRITE(50,"(A)")"============================================================================"
	WRITE(50,"(1X,A,5X,A,10X,A,10X,A,11X,A,3X,6(9X,A,3X),3X,6(4X,A))")"测点号",  &
	              "XX","YY","ZZ","频率","-|Ex|-","-|Ey|-","-|Ez|-","-|Hx|-","-|Hy|-","-|Hz|-", &
				  "Ex误差","Ey误差","Ez误差","Hx误差","Hy误差","Hz误差"
!===============================================================================================
	WRITE(51,"(A)")"源的个数"
	WRITE(51,"(I5)")POTNS
	WRITE(51,"(A)")"源位置:AX(米)      AY(米)      AZ(米)     BX(米)      BY(米)       BZ(米) 源电流(安培)"
    DO I=1,POTNS
	WRITE(51,"(6F12.2,F8.2)")LSI(I)%AX,LSI(I)%AY,LSI(I)%AZ,LSI(I)%BX,LSI(I)%BY,LSI(I)%BZ,LSI(I)%IS
    END DO
	WRITE(51,"(A)")"测点数,数据频点数"
	WRITE(51,"(2I5)")ND,M
	WRITE(51,"(A)")"============================================================================"
	WRITE(51,"(1X,A,6X,A,11X,A,11X,A,16X,A,12(21X,A))")"测点号","XX","YY","ZZ","频率",  &
	              "-REx-","-IEx-","-REy-","-IEy-","-REz-","-IEz-","-RHx-","-IHx-","-RHy-","-IHy-","-RHz-","-IHz-"
!===============================================================================================
    DO S=1,ND
       CDBLF=CDBL(S)
       CALL D1_SOTEMZ(TEDM,CDBLF,LSI,POTNS,M,N,F,MODS,EH_F)
	   DO J =1,M !频率
	   WRITE(50,'(I6,3F12.2,E16.8,6E18.10,6F10.2)')  &
	             CDBLF%N,CDBLF%X,CDBLF%Y,CDBLF%Z,F(J), &
	             EH_F(J)%EX,EH_F(J)%EY,EH_F(J)%EZ, &
	             EH_F(J)%HX,EH_F(J)%HY,EH_F(J)%HZ, &
		         0.0d0,0.0d0,0.0d0,0.0d0,0.0d0,0.0d0

	   WRITE(51,'(I6,3F12.2,E16.8,12E18.10)')  &
	             CDBLF%N,CDBLF%X,CDBLF%Y,CDBLF%Z,F(J), &
	             EH_F(J)%CEX,EH_F(J)%CEY,EH_F(J)%CEZ, &
	             EH_F(J)%CHX,EH_F(J)%CHY,EH_F(J)%CHZ
	   END DO
	WRITE(50,"(A)")"============================================================================"
	WRITE(51,"(A)")"============================================================================"
	END DO
	Close(50)
	Close(51)
	DEALLOCATE( F,EH_F )
!===================================================================
	GOTO 160
!===================================================================
130 CONTINUE
	ALLOCATE( EV_T(M) )
!===================================================================
	OPEN(unit=50,file="LD_NSOTEM_"//OUT_FILE)
	WRITE(50,"(A)")"源的个数"
	WRITE(50,"(I5)")POTNS
	WRITE(50,"(A)")"源位置:AX(米)      AY(米)      AZ(米)     BX(米)      BY(米)       BZ(米) 源电流(安培)"
    DO I=1,POTNS
	WRITE(50,"(6F12.2,F8.2)")LSI(I)%AX,LSI(I)%AY,LSI(I)%AZ,LSI(I)%BX,LSI(I)%BY,LSI(I)%BZ,LSI(I)%IS
    END DO
	WRITE(50,"(A)")"测点数,数据时窗数"
	WRITE(50,"(2I5)")ND,M
	WRITE(50,"(A)")"============================================================================"
	WRITE(50,"(1X,A,5X,A,10X,A,9X,A,10X,A,3(11X,A),1X,3(8X,A,1X),4X,6(3X,A))")"测点号",  &
	        "XX","YY","ZZ","时间(S)","Ex_t(V)","Ey_t(V)","Ez_t(V)","Vx_t(V/A)","Vy_t(V/A)","Vz_t(V/A)", &
			"Ext误差","Eyt误差","Ezt误差","Vxt误差","Vyt误差","Vzt误差"
!===================================================================
    DO S=1,ND
       CDBLF=CDBL(S)
       CALL D1_SOTEMZ(TEDM,CDBLF,LSI,POTNS,M,N,T,MODS,EV_T)
	   DO J =1,M !时窗
	   WRITE(50,'(I6,3F12.2,E16.8,6E18.10,6F10.2)') &
	             CDBLF%N,CDBLF%X,CDBLF%Y,CDBLF%Z,T(J), &
	             EV_T(J)%EX,EV_T(J)%EY,EV_T(J)%EZ, &
	             EV_T(J)%HX,EV_T(J)%HY,EV_T(J)%HZ, &
		         0.0d0,0.0d0,0.0d0,0.0d0,0.0d0,0.0d0
	   END DO
	WRITE(50,"(A)")"============================================================================"
	END DO
	Close(50)
    DEALLOCATE( T,EV_T )
!=========================================================================================================================
!===================================================================
    GOTO 160
140 CONTINUE
!===================================================================
160 CONTINUE
	DEALLOCATE( CDBL,LSI,MODS )
!*********************************************************************
!*********************************************************************
	ELSEIF (ZFYN==2) THEN
!*********************************************************************
    CALL CX_YZJC()   !创建文件夹
!*********************************************************************
    IF (TEDM==1) THEN
	WRITE(*,"(a,$)")"    请输入野外电场Ex-Ey-Ez-Hx-Hy-Hz数据文件名: "
	ELSEIF (TEDM==2) THEN
	WRITE(*,"(a,$)")"    请输入野外磁场Ext-Eyt-Ezt-Vxt-Vyt-Vzt数据文件名: "
	ELSE
	WRITE(*,"(a,$)")"    请输入野外视电阻率、相位数据文件名: "
	END IF
	READ(*,*)OUT_FILE
!----------------------------------------------------
	WRITE(*,"(a,$)")"    请输入反演模型结果文件名:"
	READ(*,*)Mod_FILE
!==========================================================================
30	WRITE(*,"(a,$)")"    请设计模型顶层厚度(5--100米):"
	READ(*,*)TOP_D
	WRITE(*,"(a,$)")"    设计模型厚度变化率(1.0--1.5):"
	READ(*,*)DSQ
	WRITE(*,"(a,$)")"    设计模型最大深度:"
	READ(*,*)MAX_H
    !----------------------------------------------------------
	IF ( DSQ/=1.0 ) N=INT( LOG(1.0D0 - MAX_H*(1.0D0-DSQ)/TOP_D)/LOG(DSQ) )+1
	IF ( DSQ==1.0 ) N=INT( MAX_H/TOP_D  )
	IF ( N<=0 ) THEN
	WRITE(*,"(a)")"    模型设计有问题请重新设计!"
	GOTO 30
	END IF
	WRITE(*,"(A,I2,A)")"    模型设计共:",N,"层"
	WRITE(*,"(A,$)")"    设计初始模型背景值:"
	READ(*,*)MAX_R
!==========================================================================
   	WRITE(*,"(A)")"    请选择:" 
  	WRITE(*,"(A)")"    (0--重新反演     ; 1--继续反演)" 
   	WRITE(*,"(A,$)")"    选择:" 		
	READ(*,*)DIEDAI
!-----------------------------------------------------------------------------
50  CONTINUE
	WRITE(*,"(A)")"*************************************************************************"
!-----------------------------------------------------------------------------
    IF (TEDM==1) THEN
	WRITE(*,"(a,$)")"    请输入Ex-Ey-Ez-Hx-Hy-Hz数据是(1)否(0)参与反演列表: "
	READ(*,*)DATE_XZ(1),DATE_XZ(2),DATE_XZ(3),DATE_XZ(4),DATE_XZ(5),DATE_XZ(6)
	ELSEIF (TEDM==2) THEN
	WRITE(*,"(a,$)")"    请输入Ext-Eyt-Ezt-Vxt-Vyt-Vzt数据是(1)否(0)参与反演列表: "
	READ(*,*)DATE_XZ(1),DATE_XZ(2),DATE_XZ(3),DATE_XZ(4),DATE_XZ(5),DATE_XZ(6)
	ELSE
	WRITE(*,"(a,$)")"    请输入视电阻率、相位数据是(1)否(0)参与反演列表: "
	READ(*,*)DATE_XZ(1),DATE_XZ(2)
    DATE_XZ(3)=0
	END IF
!-----------------------------------------------------------------------------
	WRITE(*,"(A)")"    请选择反演约束方法:"
  	WRITE(*,"(A)")"    (1--最小梯度模型约束     ; 2--最光滑模型约束)" 	 
  	WRITE(*,"(A)")"    (3--最小支撑梯度模型约束 ; 4--最小支撑光滑模型约束)" 
   	WRITE(*,"(A,$)")"    选择:"
	READ(*,*)MOD_RLZ
	IF (MOD_RLZ==3 .OR. MOD_RLZ==4) THEN
  	  WRITE(*,"(A,$)")"    请输入反演约束聚焦因子参数β(0.00001--10.0):" 
	  READ(*,*)BTAS
	ELSE
	  BTAS=0.005D0
	END IF
!==========================================================================
    WRITE(*,"(a,$)")"    请输入迭代次数:"
	READ(*,*)MAX_FDN
!==========================================================================
!**************************************************************************************************
!**************************************************************************************************
	OPEN(12,FILE=OUT_FILE)
	READ(12,*)!"源的个数"
	READ(12,*)POTNS
	READ(12,*)!"源位置AX(米)    AY(米)    AZ(米)     BX(米)     BY(米)     BZ(米) 源电流(安培)"
    ALLOCATE( LSI(POTNS) )
	DO I=1,POTNS
	READ(12,*)LSI(I)%AX,LSI(I)%AY,LSI(I)%AZ,LSI(I)%BX,LSI(I)%BY,LSI(I)%BZ,LSI(I)%IS
    END DO
	READ(12,*)!"测点数,数据频点数"
	READ(12,*)ND,M
	READ(12,*)!"==========================================================="
!==========================================================================
	ALLOCATE( FG(M),EH_FY(M),EV_ERSY(M) )
!==========================================================================
    OPEN(65,FILE="FY_MOD_OUT.TXT")
	WRITE(65,*)" 点号    位置(米)   标高(米)   电阻率(欧姆.米)   电阻率(对数)"
!**************************************************************************************************
!**************************************************************************************************
	DO 65 LLD=1,ND 
!**************************************************************************************************
	READ(12,*)
	DO J=1,M
	READ(12,*)CDBLF%N,CDBLF%X,CDBLF%Y,CDBLF%Z,FG(J),  &
	  EH_FY(J)%EX,EH_FY(J)%EY,EH_FY(J)%EZ,EH_FY(J)%HX,EH_FY(J)%HY,EH_FY(J)%HZ, &
	  EV_ERSY(J)%EX,EV_ERSY(J)%EY,EV_ERSY(J)%EZ,EV_ERSY(J)%HX,EV_ERSY(J)%HY,EV_ERSY(J)%HZ
	END DO
!**************************************************************************************************
    !----------------------------------------------------------
	BHS=CDBLF%N
	DXBG=CDBLF%Z
    !----------------------------------------------------------
	I=INT(BHS/1000)
	J=INT( (BHS - I*1000)/100 )
	K=INT( (BHS - I*1000 - J*100 )/10 )
	L=INT(  BHS - I*1000 - J*100 - K*10 )
    FY_MOD_N(1:1)=CHAR( I + 48 )
    FY_MOD_N(2:2)=CHAR( J + 48 )
    FY_MOD_N(3:3)=CHAR( K + 48 )
    FY_MOD_N(4:4)=CHAR( L + 48 )
    !----------------------------------------------------------
	ALLOCATE( MODS(N),MODF(N) )
    !----------------------------------------------------------
	IF ( DIEDAI==0 ) THEN
	  DO I=1,N
       MODS(I)%H=TOP_D*( DSQ**(I-1) )
       MODS(I)%R=MAX_R  !设置初始模型
       MODF(I)%H=MODS(I)%H
       MODF(I)%R=MAX_R  !设置初始模型
	  END DO
	ELSE
	  OPEN(unit=50,file="反演模型/"//FY_MOD_N(1:4)//Mod_FILE)
      READ(50,*)
      READ(50,*)MODS(1)%H,MODS(1)%R
	  SUH=DLOG10(MODS(1)%R)
	  DO I=2,N
         READ(50,*)MODS(I)%H,MODS(I)%R
	     SUH=SUH + DLOG10(MODS(I)%R)
	  END DO
	  CLOSE(50)
	  SUH=SUH/DBLE(N)
	  DO I=1,N
	   MODF(I)%R=10.0D0**SUH
	  END DO
	END IF
!****************************************************************************************
!**************************************************************************************************
    WRITE(*,*)
    LLL=0
    CALL D1_CSOT_MF(TEDM,DATE_XZ,POTNS,CDBLF,LSI,M,N,FG,MODS,MODF,  &
	                EH_FY,EV_ERSY,MAX_FDN,LLL,MOD_RLZ,BTAS)
!==========================================================================
	OPEN(Unit=50,file="反演模型/"//FY_MOD_N(1:4)//Mod_FILE)
	WRITE(50,"(5X,A,5X,A)")"厚度","电阻率"
    SmH=MODS(1)%H*0.5D0
	write(50,'(F10.2,F12.3)')MODS(1)%H,MODS(1)%R
	SUH=MODS(1)%H
	WRITE(65,"(F8.1,2F12.3,F19.6,E16.8)")BHS,CDBLF%X,DXBG-SUH,MODS(1)%R,DLOG10(MODS(1)%R)
	DO I =2,N !层数
    SmH=SmH + ( MODS(I)%H + MODS(I-1)%H )*0.5D0
	write(50,'(F10.2,F12.3)')MODS(I)%H,MODS(I)%R
	SUH=SUH + MODS(I)%H
	WRITE(65,"(F8.1,2F12.3,F19.6,E16.8)")BHS,CDBLF%X,DXBG-SUH,MODS(I)%R,DLOG10(MODS(I)%R)
	END DO
	WRITE(65,*)
	CLOSE(50)
!===================================================================
	DEALLOCATE( MODS,MODF )
!**************************************************************************************************
65  CONTINUE
!**************************************************************************************************
!**************************************************************************************************
	CLOSE(12)
	CLOSE(65)
    DEALLOCATE( FG,EH_FY,EV_ERSY,LSI )
!*******************************************************************
	WRITE(*,"(a,$)")"    是否继续迭代(1--是 ; 2--否):"
	READ(*,*)JXDL
	DIEDAI=1
	IF (JXDL==1) GOTO 50
!*******************************************************************
	ELSE
!*******************************************************************
	WRITE(*,"(a)")"    功能选择错误,请重选!"
	GOTO 16
!*******************************************************************
	END IF
!===================================================================
!*******************************************************************
!===================================================================
	PAUSE
	END PROGRAM